START_MESSAGE = "<i>Привет! Чем хочешь заняться сегодня?</i>"
TRAINING_BUTTON = "Тренироваться"

SELECTION_MESSAGE = "Учить по эпохам или по темам:"
SELECT_EPOCH_BUTTON = "Эпохи"
SELECT_TOPIC_BUTTON = "Темы"
SELECT_LEADER_BUTTON = "Правители"
SELECT_EPOCH = "Выберите эпоху:"
SELECT_TOPIC = "Выберите тему:"
SELECT_LEADER = "Выберите правителя:"


YOU_HAVE_EPOCH_SELECTED = "<b>Вы выбрали следующую эпоху:</b>"
YOU_HAVE_TOPIC_SELECTED = "<b>Вы выбрали следующую тему:</b>"
YOU_HAVE_LEADER_SELECTED = "<b>Вы выбрали следующего правителя:</b>"
SELECTED = "<b>{title}</b>\n\n<i>{description}</i>\n"
SELECTED_TITLE = "<b><i>{title}</i></b>"

LEVEL_SELECT = "Выберите уровень сложности:"
LEVEL_EASY = "Простой"
LEVEL_HARD = "Сложный"

NUMBER_OF_QUESTION = "Сколько вопросов вы хотите пройти (всего <b>{count}</b>):"
INVALID_NUMBER = "<i>Введёно недействительное число! Пожалуйста, попробуйте снова.</i>"
MAX_NUMBER = "<i>Всего <b>{count}</b> вопросов по теме. Пожалуйста, попробуйте снова.</i>"

QUESTION = "<b>Вопрос {pos}/{count}:</b>\n<i>{text}</i>"
ANSWER_RIGHT = "<b>✅Правильный ответ!</b>"
ANSWER_FALSE = "<b>❌Неправильный ответ!</b>\nВерный вариант: <span class='tg-spoiler'><i>{answer}</i></span>"
RESULT_ATTEMPT = "<b>Правильных ответов:</b> {right}/{count}"

ACTIONS_TEXT = "<i>Чем займёмся дальше?</i>"
RESTART_BUTTON = "На главную"
RETRY_BUTTON = "Повторить"
MAKE_HARDER_BUTTON = "💀Без подсказок💀"
NOTES_BUTTON = "❗️Заметки по ошибкам❗️"
NO_NOTES_ERROR = "Заметок не найдено!"

NOTE_TEXT = "<i>Заметки по ошибкам:</i>"
NOTE = "{text}\n\n<b>============</b>\n{questions}"
QUESTIONS_IN_NOTE = "<i>❌{question}</i> - <s>{answer}</s> <b>{right}</b>"
